window.ydoc_plugin_search_json = {
  "快速开始": [
    {
      "title": "简单修仙系统",
      "content": "此方案待填充",
      "url": "/begin/index.html",
      "children": []
    },
    {
      "title": "此方案待填充",
      "content": "",
      "url": "/begin/demo.html",
      "children": []
    }
  ],
  "百科全书": [
    {
      "title": "百科全书",
      "content": "嘿！伙计，你知道么，在过去～王者荣耀尚未流行起来的时候，我们的童年是怎么度过的呢？那时候，我们最流行的就是互相讲故事。我们在故事中无所不能，创造各种各样的宝藏，探寻想象中最幽暗的领域。接下来，就是讲述你作为勇者，打败恶龙的故事！有请我们的讲述人————面粉团姑娘～",
      "url": "/story/index.html",
      "children": []
    },
    {
      "title": "面粉团",
      "content": "没有讲述人，发生在脑海里的故事就没法继续。面粉团就是我们的讲述人。",
      "url": "/story/1/mft.html",
      "children": [
        {
          "title": "介绍",
          "url": "/story/1/mft.html#介绍",
          "content": "介绍面粉团（半脸人的粉丝团）是一个萌哒可爱胖乎乎的小肉团，不可以吃！目前性别为女，13岁。前身是上古时期女希氏先灵圣贤女娲在补天时嫌弃不要扔在凡间的石头。\n...因为还不是完全体，有点小智障。主人是高冷帅得贼溜的群主，目前团子被寄养在我家。（毕竟是我开发的2333）"
        },
        {
          "title": "名称由来",
          "url": "/story/1/mft.html#名称由来",
          "content": "名称由来我的好朋友，半脸哭半脸笑在一头扎进了小说事业，组建了一个书友群。本软件最开始是开发出来供书友群娱乐的。其实，谁来做讲述人无非是抓阄抓出来的。面粉团的真实身份是，你家邻居家的小女儿。你们通过猜拳选出了谁来做讲述人，剩下的便都能如愿以偿,扮演勇者。"
        }
      ]
    },
    {
      "title": "玩家面板",
      "content": "理解这个条目对于后续十分重要。你面前的是一个玩家面板。\n基本面\n\nID\n修为\n境界\n金币\n\n\n\n三相\n\n体质，初始50。反应你身体的健壮程度，这个数值越高，修炼越快。战斗也会越有力。\n疯狂，初始5。疯狂让你的修炼极度不稳定。疯狂高到一定程度后可能会走火入魔。\n幸运，初始0。\n\n\n\n进阶\n\n物品栏\n装备面板\n状态栏\n\n\n通过灵活的配置三相，例如，人为的进入衰弱状态，然后一次性吞服与体质相关的药剂，这会让你获得双倍体质。三相和灵活切换装备的存在，让游戏十分具有策略性。在任何时候，你可以使用查看命令，来获取你的基本数据。查看#装备栏，让你可以查看当前的装备。",
      "url": "/story/2/property.html",
      "children": []
    },
    {
      "title": "行为（1）",
      "content": "玩家的行为是逐步开放的。我们总应该以签到，来开始游戏。其实签到就是修炼的意思。如果你是第一次签到，签到就会为你创建一个用户。其他常见的操作还有，挑战@某角色，抽奖，购买#物品名，出售#物品名，使用#物品名。你可能会觉得这串名单有点长，但放心，很多功能是逐步开放的，并不会过于难以学习。",
      "url": "/story/2/action.html",
      "children": [
        {
          "title": "签到",
          "url": "/story/2/action.html#签到",
          "content": "签到签到是最基础的获得修为的方式。"
        },
        {
          "title": "基础",
          "url": "/story/2/action.html#签到-基础",
          "content": "基础一天可以签到一次。\n每次签到你都会获得一枚金币。幸运判定通过时翻倍。\n如果一周均进行了签到，额外获得一枚金币。\n节假日的签到额外获得100点修为。\n签到会触发一些事件。\n"
        },
        {
          "title": "修为计算",
          "url": "/story/2/action.html#签到-修为计算",
          "content": "修为计算签到获取的修为，为下列数字之和：体质的数值，幸运判定通过时翻倍。\n进行两次疯狂判定，修为加减其乘。\n当前修为的1%。\n"
        },
        {
          "title": "挑战",
          "url": "/story/2/action.html#挑战",
          "content": "挑战@一名角色，和该角色进行战斗。挑战是很重要的交互方式。"
        },
        {
          "title": "战力计算",
          "url": "/story/2/action.html#挑战-战力计算",
          "content": "战力计算\n战力=(修为+602)*发挥系数。\n\n\n发挥系数=(体质判定+疯狂判定)/100。\n\n\n每次战斗均有机会触发一次幸运判定，通过则战力翻倍。\n\n"
        },
        {
          "title": "结算",
          "url": "/story/2/action.html#结算",
          "content": "结算战力比r=我方战力/对方战力\n九死一生：r<0.1，修为-30%，判定一次挫折。\n\n\n螳臂当车：0.1<=r<0.6，疯狂+3，体质-2，进行一次体质判定，被对方夺取对应修为。\n\n\n略输一筹：0.6<=r<0.9，用20作普通判定，若通过则体质+2。否则进行一次体质判定，被夺取判定结果一半的修为。\n\n\n和：0.9<=r<1.1，判定一次体质，双方均获得其之和。\n\n\n小胜三分：1.1<=r<2，用20作普通判定，若通过则体质+4。否则进行一次体质判定，夺取对方判定结果一半的修为。\n\n\n旗开得胜：2<=r<4，判定两次体质，求和，夺取对方对应修为。\n\n\n易如反掌：4<=r<8，判定一次体质，求和，夺取对方对应修为。\n\n\n仁义尽失：8<=r，疯狂+2，你判定一次疯狂，失去等于其绝对值的数值，对方判定一次挫败。\n\n修正指数=敌方修为/我方修为若我方为弱势方，获胜所得修为乘以该指数，失败时除以该指数\n若我方为强势方，获胜所得除以该指数，失败时乘以该指数\n"
        }
      ]
    },
    {
      "title": "道具大全",
      "content": "大多数道具",
      "url": "/story/items.html",
      "children": [
        {
          "title": "B级道具",
          "url": "/story/items.html#b级道具",
          "content": "B级道具人类智慧的结晶，一些工艺品。每种各5个。"
        },
        {
          "title": "丹药类",
          "url": "/story/items.html#b级道具-丹药类",
          "content": "丹药类\n\n道具名\n图标\n价格\n类别\n作用\n描述\n\n\n\n\n回气丹\n\n5～12\n消耗品\n体力+5\n修炼者必备，用于快速回复\n\n\n伤药\n\n4～8\n消耗品\n持有伤药的时候，抵消一次修为减少\n务必理性用药\n\n\n红药水\n\n9～11\n消耗品\n疯狂+3，体力+9\n疯狂，躁动，反应\n\n\n聚魔瓶\n\n4～4\n消耗品\n判定一次幸运，通过随机获得一个A级道具\n闪烁着诡异的光泽\n\n\n邪灵药剂\n\n2～9\n消耗品\n疯狂+4\n不疯魔，不成活\n\n\n复合药\n\n3～33\n消耗品\n体力+2，疯狂-2，修为+10\n一针入，一针出\n\n\n序列1\n\n3～33\n消耗品\n50%概率幸运+1，20%概率获得4金币，1%概率获取100金币\n梦幻\n\n\n序列10\n\n7～17\n消耗\n进行一次疯狂判定，加减对应数值\n诱惑\n\n\n迷迭草\n\n1～17\n消耗\n@一个目标，50%对方体力-10，50%你入坑了\n做那件事情前的辅佐药剂\n\n\n笑粉\n\n1～17\n消耗\n@一个目标，让他十个小时内无法操作\n五颜六色，开怀大笑\n\n\n"
        },
        {
          "title": "石头类",
          "url": "/story/items.html#b级道具-石头类",
          "content": "石头类\n\n道具名\n图标\n价格\n类别\n作用\n描述\n\n\n\n\n回气丹\n\n1～7\n消耗品\n体力+2，满月时使用，20%加1点幸运\n一闪一闪亮晶晶\n\n\n宝石\n\n4～444\n消耗品\n\n大自然鬼斧神工\n\n\n邪气石\n\n1～2\n消耗品\n疯狂+3\n黑暗府邸的产物\n\n\n黑金属\n\n2～9\n消耗品\n修为+50，有概率+100\n其中蕴含着灵气，只是不大好消化\n\n\n闪回石\n\n7～9\n消耗品\n疯狂-10，超过部分加体质\n其上有闪电回文\n\n\n"
        },
        {
          "title": "装备类",
          "url": "/story/items.html#b级道具-装备类",
          "content": "装备类\n\n道具名\n图标\n价格\n类别\n作用\n描述\n\n\n\n\n木剑\n\n2～12\n持有物\n现在，你在战斗方面，幸运计算翻倍\n\n\n\n木盾\n\n2～12\n持有物\n你不会再被挑战夺取修为了\n\n\n\n铁盾\n\n17～27\n持有物\n每次被挑战，触发一次体质判定，增加对应数值\n擅守者，无所攻\n\n\n铁剑\n\n17～27\n持有物\n挑战比自己强的对手时，50%概率体质+3\n擅攻者，无所不攻\n\n\n护身符\n\n22\n持有物\n幸运+5\n\n\n\n银剑\n\n33～56\n持有物\n挑战并获取修为时，双倍获取\n\n\n\n银盾\n\n33～56\n持有物\n\n\n\n\n"
        },
        {
          "title": "道具类",
          "url": "/story/items.html#b级道具-道具类",
          "content": "道具类\n\n道具名\n图标\n价格\n类别\n作用\n描述\n\n\n\n\n藏书阁钥匙\n\n12～56\n持有物\n能使用的日期存在一定秘诀，平方数日打开时，体质+20；双数日打开时，重置今日cd\n\n\n\n会员卡\n\n100\n持有物\n商店购买费用-1\n\n\n\n序列9\n\n1～240\n消耗品\n用于高级物品的附魔\n反伤\n\n\n序列2\n\n1～240\n消耗品\n立即进行一次美德判定\n真挚\n\n\n序列3\n\n1～240\n消耗品\n修为+300\n质朴\n\n\n"
        },
        {
          "title": "A级道具",
          "url": "/story/items.html#a级道具",
          "content": "A级道具久经过人工雕琢之物，能提供极大的价值。A级道具每种各1个。"
        },
        {
          "title": "武器类",
          "url": "/story/items.html#武器类",
          "content": "武器类\n\n道具名\n图标\n价格\n类别\n作用\n描述\n\n\n\n\n勋爵\n\n107\n价格消耗品\n\n作用一闪一闪亮晶晶\n\n\n"
        },
        {
          "title": "S级宝物",
          "url": "/story/items.html#s级宝物",
          "content": "S级宝物暂未出世。"
        }
      ]
    }
  ]
}